// ! Стрілочні функції
// функція-вираз
let someFunc = function (a) {
  return a + 100;
}

console.log(someFunc(5)); // 105
____________________________________________________________________________________________________________________
// Перетворюємо попередню функцію на стрілочну
let someFunc1 = (a) => { // коли у нас один аргумент, ми можемо позбутися дужок навколо нього
  return a + 100;
}

console.log(someFunc1(6)); // 106
____________________________________________________________________________________________________________________
// Якщо позбутися слова return (тоді, коли код має один оператор), то треба позбутися і фігурних дужок, інакше, буде вибивати результат undefined.
let someFunc2 = a => { a + 100; }
console.log(someFunc2(1)); // undefined
____________________________________________________________________________________________________________________
// Повернення об'єкта
const someFunc3 = a => { value: a + 100 }
console.log(someFunc3(3)); // тут виб'є undefined, тому що фігурні дужки сприймаються як тіло функції. Щоб розрізнити об'єкт від тіла функції, потрібно об'єкт огорнути звичайними круглими дужками:

const someFunc4 = a => ({ value: a + 100 });
console.log(someFunc4(10)); // {value: 110}
____________________________________________________________________________________________________________________
// Стрілочні функції не підходять на роль методів:
var obj = {
  i: 10,
  b: () => console.log(this.i, this), // this - цей об'єкт, this.i - властивість і цього об'єкта
  c: function () {
    console.log(this.i, this)
  }
}

obj.b(); // undefined {}
obj.c(); // 10 {i: 10, b: f, c: f} тут буде той самий об'єкт
____________________________________________________________________________________________________________________
var arguments = [1, 2, 3];
var arr = () => arguments[0];
console.log(arr()); // 1. Тут стрілочна функція використовую зовнішній масив arguments, а не свій об'єкт arguments.

function foo(n) {
  var f = () => arguments[0] + n;
  return f();
}

console.log(foo(3)); // 6

function foo1(n) {
  var f = () => arguments[1] + n;
  return f();
}

console.log(foo1(3, 4)); // 7
// ! Тобто, у стрілочної функції немає свого об'єкта arguments, а у звичайної функції є.
