// ! npm
// це менеджер пакетів для js

// ? Він складається із наступних компонентів:
// 1. Registry - репозиторій, база даних, де знаходяться пакети
// 2. CLI (Command Line Interface) - набір команд, що дозволяє взаємодіяти із npm-репозиторієм. Є ще альтернатива до npm - yarn. Команди можуть відрізнятися
// 3. Вебсайт - надає додаткові можливості роботи з пакетами (пошук пакетів, налаштування приватності до нього)
//_________________________________________________________________________________________________________________

// node --version - показує, чи встановлений node.js і його версію
// npm --version - показує версію npm
// npm init - ініціалізує проект. Створюється файл - package.json - конфігураційний файл
// npm run + назва сценарію - запускаємо сценарій із package.json

// ! Dependencies
// Робити якісь зміни залежностей не прийнято робити у "dependencies", а у "devDependencies". Важливо розділити пакети, які ми будемо використовувати на різних стадіях - стадія розробки і білдінг
// Версіювання пакетів: {majorVersion}.{minorVersion}.{patchVersion} - 3.1.2. ^5.74.0 - означає встановлення версій, що сумісні із цією.
// ? Major: Стабільні версії пакетів нумерують від одиниці.Тобто 0 на місці major означає, що пакет нестабільний і всі подальші зміни можуть бути несумісними. Зміна у major-версії означає, що нова версія може бути несумісна із попередньою.

// ? Minor: Зміна у minor-версії означає, що додалися нові функціональності без порушення існуючих.

// ? Patch: Зміна у patch-версії - це виправлення помилок.

// Package-lock.json - описує не тільки залежності, але й залежності всіх залежностей
// Щоб встановити конкретну версію пакета: npm i webpack@5.73.0 --save-dev // --save-dev - записує пакет у "devDependencies"
// npm i - npm знаходить залежності і встановлює їх
//__________________________________________________________________________________________________________________

// ? Є альтернативи для npm - yarn i turbo. Але npm автоматично встановлюється, коли інсталюється Node.js.
// package.json - мусить містити назву і версію, мусить бути написаним нижнім регістром і одним словом, може мати у собі дефіси і нижні підкреслення.

// npm install -g <package-name> - встановлює пакети глобально
// npm install --global <package-name>

// npm install -P <package-name> - пакет з'явиться у dependencies
// npm install --save-prod <package-name>

// npm install -D <package-name> - пакет з'явиться у devDependencies
// npm install --save-dev <package-name>

// npm install -O <package-name> - пакет з'явиться у optionalDependencies
// npm install --save-optional <package-name>

// --no-save - не збереже у dependencies
// -E, --save-exact - збережені залежності конфігуруються із цією версією
// -B, --save-bundle - залежності будуть додані до bundleDependencies
// --production - модулі не будуть встановлюватися у devDependencies

// ~version - приблизний еквівалент версії
// version - версія має збігатися із теперішньою
// >version - має бути пізніша, ніж теперішня
// >=version
// 1.2.x - 1.2.0, 1.2.1, etc, але не 1.3.0
// * - будь-яка версія
// latest - остання


