// ! 1. Порівняння за значенням та за посиланням

// У JS можна зустріти два типи порівнянь: порівняння за значенням та порівняння за посиланням. Розібратися в цих концепціях дуже важливо. Також, такі задачки часто використовуються на співбесідах для того, щоб вияснити чи є у кандидата розуміння різниці між цими двома типами порівняння.

// 🔸Порівняння за значенням

// Коли ми порівнюємо примітивні типи даних (числа, рядки, булеві значення), ми робимо це за значенням:

// const x = 5;
// const y = 5;

// console.log(x === y); // true. значення однакові


// 🔸Порівняння за посиланням

// У випадку об'єктів (об'єктів, масивів, функцій), порівняння відбувається за посиланням, а не за значенням:

// let a = { val: 1 };
// let b = { val: 1 };

// console.log(a === b); // false. a i b посилаються на різні обʼєкти в памʼяті

// Через це, навіть якщо об'єкти виглядають однаковими, порівняння повертає false. Це тому, що об'єкти зберігаються в пам'яті незалежно один від одного, і "посилання" на об'єкт по суті є адресою його місцезнаходження в пам'яті.

// 🔸Порівняння об'єктів за допомогою методів

// Щоб порівняти два об'єкти по значенням, можна використовувати методи, такі як JSON.stringify():

// const a = { val: 1 };
// const b = { val: 1 };

// console.log(JSON.stringify(a) === JSON.stringify(b));

console.log([2] == [2]); // false
// ! _______________________________________________________________________________________________________________